cases/ibm_inclined_45/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
momentumSource
{
    type            ibMeanVelocityForce;
    active          yes;

    ibMeanVelocityForceCoeffs
    {
        selectionMode   all;

        fieldNames      (U);
        Ubar            (0.5 0 0);
    }
}

*/
//************************************************************************* //
