cases/ibm_inclined_45/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

/*
     p
    {
        solver          PCG;
        preconditioner  DIC;
//        smoother        DICGaussSeidel;
//        preconditioner  none;
        minIter          1;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0.01;

    }
*/


    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        //solver          PBiCGStab;
//        solver          BICCG;
//        smoother        DIC;
//        preconditioner  DILU;
//        preconditioner  none;
        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    pRefPoint (0 0.5 0);
    pRefValue 0;
    consistent      no;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|epsilon|omega|f|v2)" 1e-5;
    }
}
/*
relaxationFactors
{
    equations
    {
        U               0.5; // 0.9 is more stable but 0.95 more convergent
        p               0.5; // 0.9 is more stable but 0.95 more convergent
        k               0.5; // 0.9 is more stable but 0.95 more convergent
        epsilon         0.5; // 0.9 is more stable but 0.95 more convergent
    }
}*/
relaxationFactors
{
    U          0.5;
    p          0.5;
    k          0.5;
    epsilon    0.5;
}


// ************************************************************************* //
