cases/ibm_inclined_45/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name c;
        type    cellSet;
        action new;

        // Select based on immersed boundary surface
        source immersedBoundarySurfaceToCell;
        sourceInfo
        {
            file            "./constant/triSurface/wallIB.stl";
            outsidePoints   ((0.005 0.025 0.005));    // definition of outside
            ibmRefineMeshInsideLayers 2;
            ibmRefineMeshOutsideLayers 5;
        }
    }

);


// ************************************************************************* //
