cases/ibm_inclined_45/system/topoSetDict4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name c;
        type    cellSet;
        action new;
/*        source  boxToCell;*/
/*        sourceInfo*/
/*        {   */
/*            box (0 -0.03 -1) (2 0.05 1);*/
/*        }*/
  	    source rotatedBoxToCell;
    	sourceInfo
    	{
       		origin   (0 -0.03 -1);
       		i        (4 4 0);
       		j        (0 0.1 0);
       		k        (0 0 2);
    	}
    }

);


// ************************************************************************* //
